Revit 2027 API
RebarUpdateCurvesData.GetBarModelDiameter Method
 Gets the model diameter of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetBarModelDiameter()
Public Function GetBarModelDiameter As Double
public:
double GetBarModelDiameter()
member GetBarModelDiameter : unit -> float
Return Value
Double
 Returns the model diameter of the Rebar.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace